{
  "terms": {
    "title": "Terms of Service",
    "sections": [
      {
        "id": "introduction",
        "heading": "Introduction",
        "content": "These Terms of Service (\"Terms\") govern the use of the Diet Planner web application (\"Service\") provided by the Service Provider (\"we,\" \"us\"). By creating an account and using the Service, you (\"User,\" \"you\") agree to be bound by these Terms, including the Data Processing Agreement and the Privacy Policy.\n\n**You may only use this Service if you are a qualified, professional dietitian. This Service is not intended for use by the general public or patients.**"
      },
      {
        "id": "definitions",
        "heading": "1. Definitions",
        "content": "- **Service Provider:** The provider of the Diet Planner web application.\n- **User:** A qualified, professional dietitian who creates an account to use the Service.\n- **Service:** The Diet Planner web-based application, providing AI-powered tools to assist Users in creating meal plans for their clients.\n- **Patient Data:** Any information uploaded or entered into the Service by the User, including the personal and health-related data of the User's clients (e.g., age, weight, health conditions, allergies). Patient Data is considered \"Special Category Data\" under RODO (GDPR).\n- **AI Content:** Any meal plan, nutritional information, or other text generated by the third-party AI models within the Service.\n- **RODO:** Regulation (EU) 2016/679 (General Data Protection Regulation), referred to in Poland as Rozporządzenie o Ochronie Danych Osobowych.\n- **DPA:** The Data Processing Agreement, which forms an integral part of these Terms."
      },
      {
        "id": "service-description",
        "heading": "2. Service Description",
        "content": "1. The Service is a software tool designed to assist Users in generating and managing meal plans. It is provided \"as-is\" and \"as-available.\"\n2. The Service utilizes artificial intelligence models provided by third-party services (see Privacy Policy) to generate AI Content.\n3. **MVP & Future Changes:** The Service is currently provided as a Minimum Viable Product (MVP) free of charge. The Service Provider reserves the right to introduce fees, modify features, or transition to a paid subscription model in the future. Users will be notified via email at least 30 days in advance of any such material changes, including new pricing."
      },
      {
        "id": "user-obligations",
        "heading": "3. User Obligations and Warranties",
        "content": "By using the Service, the User expressly warrants (guarantees) that:\n\n1. **Professional Status:** You are a qualified, practicing dietitian with the necessary professional credentials and liability insurance, in compliance with all applicable Polish and EU laws.\n2. **Data Controller Status:** You are the Data Controller (Administrator Danych) for all Patient Data you process using the Service. The Service Provider is acting as your Data Processor (Podmiot Przetwarzający).\n3. **Legal Basis for Processing:** You have a valid legal basis under RODO Article 6 and Article 9 (for health data) to process all Patient Data you enter into the Service. This includes, but is not limited to, obtaining explicit, informed consent from your patients or establishing a basis under Art. 9(2)(h) (provision of health care).\n4. **Data Accuracy and Consent:** You are solely responsible for the accuracy, quality, and legality of all Patient Data and for obtaining all necessary consents from your patients to process their data using this Service and its third-party sub-processors.\n5. **Account Security:** You are responsible for maintaining the confidentiality of your account credentials and for all activities that occur under your account."
      },
      {
        "id": "ai-content-responsibility",
        "heading": "4. AI Content and Professional Responsibility",
        "content": "1. **AI CONTENT IS NOT MEDICAL ADVICE.** The User acknowledges that all AI Content is generated by automated systems and is provided for informational purposes only. It is not a substitute for professional medical or nutritional judgment.\n2. **USER MUST VERIFY ALL CONTENT.** The User agrees to independently and professionally review, verify, and approve all AI Content for accuracy, completeness, and suitability before providing it to any patient.\n3. **SOLE PROFESSIONAL LIABILITY.** The User retains full, sole, and exclusive professional responsibility and liability for all meal plans and advice provided to their patients, whether generated by the Service or not. The Service Provider has no professional liability whatsoever."
      },
      {
        "id": "limitation-liability",
        "heading": "5. Limitation of Liability",
        "content": "1. To the maximum extent permitted by Polish law, the Service Provider disclaims all warranties, express or implied.\n2. The Service Provider shall not be liable for:\n   - Any errors, inaccuracies, or suitability of the AI Content.\n   - Any professional malpractice, claims, or damages arising from the User's provision of meal plans to patients.\n   - Any data breach or loss resulting from the User's negligence (e.g., weak password, sharing account).\n   - Any loss of data, loss of profit, or business interruption.\n3. The Service Provider's total liability in connection with these Terms shall be limited to the amount paid by the User for the Service in the 12 months preceding the claim (or, for the free MVP, limited to 100 PLN)."
      },
      {
        "id": "data-processing",
        "heading": "6. Data Processing",
        "content": "1. The User is the Data Controller and the Service Provider is the Data Processor with respect to Patient Data.\n2. By accepting these Terms, the User simultaneously enters into and accepts the Data Processing Agreement (DPA). This DPA is a mandatory requirement under RODO Article 28 and governs the processing of all Patient Data."
      },
      {
        "id": "term-termination",
        "heading": "7. Term and Termination",
        "content": "1. These Terms become effective upon account creation and remain in effect until terminated.\n2. The User may terminate their account at any time from within the account profile settings.\n3. The Service Provider may suspend or terminate a User's account for any breach of these Terms, including failure to maintain professional qualifications.\n4. **Effect of Termination:** Upon termination, the User's account and all associated Patient Data will be deleted in accordance with the DPA."
      },
      {
        "id": "terms-modifications",
        "heading": "8. Modifications to Terms",
        "content": "1. We reserve the right to modify these Terms at any time. Users will be notified of material changes via email to their registered email address.\n2. Continued use of the Service after such notification constitutes acceptance of the new Terms."
      },
      {
        "id": "governing-law",
        "heading": "9. Governing Law and Jurisdiction",
        "content": "1. These Terms shall be governed by and construed in accordance with the laws of the Republic of Poland.\n2. Any disputes arising from these Terms shall be subject to the exclusive jurisdiction of the competent courts in Poland."
      }
    ]
  },
  "privacy": {
    "title": "Privacy Policy",
    "sections": [
      {
        "id": "introduction",
        "heading": "Introduction",
        "content": "This Privacy Policy explains how we collect, use, and protect personal data.\n\n_This policy is structured in two parts, reflecting our two distinct roles under RODO:_\n\n- **Part A:** When we act as a Data Controller for our Users' (dietitians') account data.\n- **Part B:** When we act as a Data Processor for the Patient Data our Users upload."
      },
      {
        "id": "data-controller-info",
        "heading": "PART A: We as Data Controller (for User Account Data)",
        "content": "This part applies to the personal data we process for our own purposes, i.e., the data of the dietitians who sign up for our Service.\n\n### Data Controller\n\nThe Data Controller for your User data is the Service Provider.\n\n### Data We Collect (Users)\n\n- **Account Data:** Email address, hashed password.\n- **Preferences:** Language, theme preference.\n- **Legal Data:** Record of Terms acceptance (timestamp, version).\n- **Usage Data (Analytics):** Anonymized or aggregated data such as session count, features used, number of meal plans created.\n\n### Legal Basis for Processing (RODO)\n\n- **Art. 6(1)(b):** Processing is necessary for the performance of a contract (these Terms) to provide you with the Service.\n- **Art. 6(1)(f):** Processing Usage Data for analytics and service improvement is our legitimate interest.\n\n### Data Retention (User Data)\n\nWe retain your User Account Data for as long as your account is active. Upon account deletion, we will delete this data within 30 days. We may retain anonymized Usage Data indefinitely."
      },
      {
        "id": "data-processor-info",
        "heading": "PART B: We as Data Processor (for Patient Data)",
        "content": "This part applies to the Patient Data that you, the User (dietitian), enter into the Service.\n\n- You are the Data Controller (Administrator) for this data.\n- We are the Data Processor (Podmiot Przetwarzający).\n\nWe only process Patient Data on your behalf and according to your instructions (i.e., your use of the Service). All processing of this data is governed by the Data Processing Agreement (DPA). Please refer to the DPA for all details regarding the processing of Patient Data.\n\n**A note on AI Conversation History:**\n\nTo the extent this history contains Patient Data, we process it as a Processor under the DPA. It is not retained permanently and will be deleted upon account termination, as specified in the DPA.\n\nWe may retain anonymized, non-personal elements of this data (e.g., \"AI model X was used 500 times today\") for our legitimate interest (Art. 6(1)(f)) in service analytics and improvement. This anonymized data cannot be linked back to any individual patient."
      },
      {
        "id": "data-categories",
        "heading": "Data Categories",
        "content": "**Account Data (Users):**\n- Email address, hashed password\n- Language and theme preferences\n- Record of Terms acceptance\n\n**Patient Data (processed as Processor):**\n- Personal Details: Age, weight, height, activity level\n- Special Category Data (RODO Art. 9): Medical conditions, dietary restrictions, allergies, and other health information\n- Meal Plans: Stored in database, associated with user account\n\n**Usage Data:**\n- Anonymized or aggregated analytics data\n- Session count, features used, number of meal plans created"
      },
      {
        "id": "data-protection-rights",
        "heading": "PART C: Your Data Protection Rights (RODO)",
        "content": "As a data subject (this applies to Users regarding their own account data), you have the right to:\n\n- Access your data (Art. 15).\n- Rectify incorrect data (Art. 16).\n- Erasure ('right to be forgotten') of your data (Art. 17).\n- Restrict processing (Art. 18).\n- Data Portability (Art. 20).\n- Object to processing (Art. 21).\n\nTo exercise these rights, please contact us or use the tools in your account profile.\n\n**Right to Lodge a Complaint:**\n\nYou have the right to lodge a complaint with the Polish data protection authority, the Prezes Urzędu Ochrony Danych Osobowych (UODO)."
      },
      {
        "id": "data-security",
        "heading": "Data Security",
        "content": "We implement appropriate technical and organizational measures to protect data, including:\n\n- Encryption in transit (HTTPS/TLS) and at rest\n- Secure authentication via Supabase Auth\n- Database-level security (Row Level Security)\n- We rely on the security measures of our sub-processors (see below)\n\nUsers are responsible for maintaining account security (password). The platform is not liable for breaches caused by user negligence."
      },
      {
        "id": "third-party-services",
        "heading": "Sub-Processors and Data Transfers",
        "content": "We use third-party services (sub-processors) to provide the Service. By using our Service, you authorize us to use them.\n\n- **Supabase (EU)**\n  - Service: Database and authentication\n  - Location: EU Region (Frankfurt)\n  - _Note: Data is stored within the European Economic Area (EEA)._\n\n- **OpenRouter.ai (USA)**\n  - Service: AI model access and generation\n  - Location: United States\n  - _Note: This involves a transfer of data outside the EEA. This transfer is secured by Standard Contractual Clauses (SCCs)._\n\n- **DigitalOcean (EU/USA)**\n  - Service: Application hosting\n  - Location: EU Region (preferred) or USA\n  - _Note: If hosted outside the EEA, this transfer is also secured by Standard Contractual Clauses (SCCs)._\n\nUsers should review third-party privacy policies."
      },
      {
        "id": "data-retention",
        "heading": "Data Retention",
        "content": "**Account Data (User Data):** Retained for as long as your account is active. Upon account deletion, we will delete this data within 30 days. We may retain anonymized Usage Data indefinitely.\n\n**Patient Data:** Processed as a Data Processor. Retained until deleted by user or account deletion. All Patient Data will be deleted upon termination of the account in accordance with the DPA.\n\n**AI Conversation History:** To the extent this contains Patient Data, it is processed under the DPA and will be deleted upon account termination. We may retain anonymized, non-personal elements indefinitely for analytics.\n\nUsers can delete meal plans and accounts at any time."
      },
      {
        "id": "dpa-summary",
        "heading": "Data Processing Agreement (DPA) Summary",
        "content": "The Data Processing Agreement (DPA) forms a legally binding part of the Terms of Service between:\n\n- The User (dietitian) (referred to as the \"Controller\") AND\n- The Service Provider (referred to as the \"Processor\")\n\n### Key DPA Provisions:\n\n**Subject-Matter:** The Processor processes Patient Data on behalf of the Controller for the sole purpose of providing the Service (e.g., storing data, generating AI meal plans, allowing User to edit and export plans).\n\n**Nature and Duration:** Storing, processing (via AI), and retrieving Patient Data as instructed by the Controller. Duration: For the duration of the User's active account. All Patient Data will be deleted upon termination of the account.\n\n**Categories of Personal Data:** Personal details (age, weight, height, activity level) and Special Category Data (RODO Art. 9): medical conditions, dietary restrictions, allergies, and other health information.\n\n**Processor Obligations:**\n- Process data only on documented instructions\n- Ensure confidentiality of personnel\n- Implement appropriate security measures (Art. 32)\n- Manage sub-processors in compliance with Art. 28(2)\n- Secure international transfers with SCCs\n- Assist Controller with Data Subject Rights requests\n- Delete all Patient Data upon account termination\n\nBy accepting the Terms of Service, you automatically enter into this DPA."
      },
      {
        "id": "policy-changes",
        "heading": "Changes to this Policy",
        "content": "We may update this policy. We will notify you of significant changes via email to your registered email address."
      }
    ]
  }
}
